trumble.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-06-14 Fri 00:43 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Trumble</title>
<meta name="author" content="john" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Trumble</h1>
<div id="outline-container-orgf172565" class="outline-2">
<h2 id="orgf172565">The world's greatest robot, you wouldn't believe</h2>
<div class="outline-text-2" id="text-orgf172565">
<ul class="org-ul">
<li><b><a href="https://github.com/jjsullivan5196/trumble/blob/master/RNN%20For%20Text%20Generation.ipynb">Demo Jupyter Notebook</a></b></li>
</ul>
</div>

<div id="outline-container-org0e9ea39" class="outline-4">
<h4 id="org0e9ea39">Content warning</h4>
<div class="outline-text-4" id="text-org0e9ea39">
<p>
This is not an <a href="https://abcnews.go.com/Politics/donald-trumps-history-adolf-hitler-nazi-writings-analysis/story?id=105810745">endorsement of facism</a>.
</p>

<p>
What happens when you put Donald Trump's twitter account into a
recurrent neural network? You get a trump robot of course.
</p>

<p>
The notebook has more details on how this works, but here's a sampling
of the final product
</p>

<ul class="org-ul">
<li>Doug Jones are using the incompetent and back to Super Monthman Steep
and so many go? Great job on @nbc @FoxNews but we've said that took
lead trade!</li>

<li>Moore is being released. Not even close. Can we mate must be announce
that it's donely high failure of winning 94,000 fuch atclited to
learn!</li>

<li>Jones tonight! The Democrats&#x2026; CAFFO. I will not want to take in a
different lightment said I will leave for America! He had to see the
brave!</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2018-06-01 Fri 00:00</p>
<p class="author">Author: john</p>
<p class="date">Created: 2024-06-14 Fri 00:43</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
